//123321是一个非常特殊的数，它从左边读和右边读是一样的
//输入一个正整数你，编程求所有这样的五位和六位十进制数，满足各位数字之和等于n
//输入格式:输出一行，包含一个正整数n
//输出格式：按从小到大的顺序满足条件的整数，每个整数占一行
//样例输入 52
//样例输出 899998 989989 998899
//数据规模和约定：1<=n<=54

#include <stdio.h>
int main()
{
    int a,b,c,d,e,f,n;
    long i;
    scanf("%d",&n);
    for (i=10000; i<=99999; i++)
    {
        b=i/10000;
        c=i/1000%10;
        d=i/100%10;
        e=i/10%10;
        f=i%10;
        if((b==f && c==e) && b+c+d+e+f==n)
            printf("%d\n",i);
    }
    for(i=100000;i<=999999;i++)
    {
        a=i/100000;
        b=i/10000%10;
        c=i/1000%10;
        d=i/100%10;
        e=i/10%10;
        f=i%10;
        if ((a==f && b==e && c==d) && a+b+c+d+e+f==n)
            printf("%ld\n",i);
    }
    return 0;
}
